//Para este caso este copy es la interface
**free
   dcl-Ds DsUsuario like

     dcl-s wNombreT char(10) Template;     //Diccionario, estas variables son solo para mi programa no son globales
     dcl-s wIdT int(5) Template;